---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.PreviousCurveType
source: html/4d79042a-d186-d559-87f2-f34e0652a31c.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.PreviousCurveType Property

The HorizontalCurveType
 of the curve which connects the endpoint to the previous displayed curve.
 If this endpoint's Station equals
 DisplayedStartStation , returns Unknown curve type.

## Syntax (C#)
```csharp
public HorizontalCurveType PreviousCurveType { get; internal set; }
```